# Video1

In [2]:
import numpy as np
import pandas as pd

In [216]:
pd.Series(data=[1,'a','sushant','sujay','pranay'])

0          1
1          a
2    sushant
3      sujay
4     pranay
dtype: object

In [217]:
s = pd.Series(data=[1,'a','sushant','sujay','pranay'], index=[-1, -2, -3, -4, -5])

In [218]:
s

-1          1
-2          a
-3    sushant
-4      sujay
-5     pranay
dtype: object

In [219]:
s[-5]

'pranay'

In [220]:
type(s[-1])

int

In [221]:
s = pd.Series(data=[1,'a','sushant','sujay','pranay'], index=['~', '!', '#', '$', '%'])

In [222]:
s

~          1
!          a
#    sushant
$      sujay
%     pranay
dtype: object

In [223]:
s['~'],s['%']

(1, 'pranay')

In [224]:
import numpy as np

In [225]:
series_1 = pd.Series(np.arange(1, 6), ['a','b','d','e','f'])

In [226]:
series_1

a    1
b    2
d    3
e    4
f    5
dtype: int32

In [227]:
series_2 = pd.Series(np.arange(6, 1, -1), ['a','c','e','g','h'])

In [228]:
series_2

a    6
c    5
e    4
g    3
h    2
dtype: int32

In [229]:
series_1 + series_2

a    7.0
b    NaN
c    NaN
d    NaN
e    8.0
f    NaN
g    NaN
h    NaN
dtype: float64

In [230]:
series_1 / series_2

a    0.166667
b         NaN
c         NaN
d         NaN
e    1.000000
f         NaN
g         NaN
h         NaN
dtype: float64

In [231]:
series_1

a    1
b    2
d    3
e    4
f    5
dtype: int32

In [232]:
series_1[0]

1

In [233]:
series_1['a'] = 5

In [234]:
series_1

a    5
b    2
d    3
e    4
f    5
dtype: int32

# Video 2

In [235]:
myData = np.random.randn(4,3)

In [236]:
myData

array([[ 0.22939744, -0.18463939, -0.23166489],
       [ 0.39923383,  0.38327647, -0.13657712],
       [ 0.66611008,  0.52695493, -0.31534821],
       [-0.53907903, -0.92814685,  0.08035325]])

In [237]:
myDataFrame = pd.DataFrame(myData, ['R1', 'R2', 'R3', 'R4'], ['C1', 'C2', 'C3'])

In [238]:
myDataFrame

          C1        C2        C3
R1  0.229397 -0.184639 -0.231665
R2  0.399234  0.383276 -0.136577
R3  0.666110  0.526955 -0.315348
R4 -0.539079 -0.928147  0.080353

In [239]:
myDataFrame['C1']

R1    0.229397
R2    0.399234
R3    0.666110
R4   -0.539079
Name: C1, dtype: float64

In [240]:
series_1[:]

a    5
b    2
d    3
e    4
f    5
dtype: int32

In [241]:
myDataFrame[:]

          C1        C2        C3
R1  0.229397 -0.184639 -0.231665
R2  0.399234  0.383276 -0.136577
R3  0.666110  0.526955 -0.315348
R4 -0.539079 -0.928147  0.080353

In [242]:
myDataFrame['C1']

R1    0.229397
R2    0.399234
R3    0.666110
R4   -0.539079
Name: C1, dtype: float64

In [243]:
myDataFrame[:1]

          C1        C2        C3
R1  0.229397 -0.184639 -0.231665

In [244]:
myDataFrame[:]

          C1        C2        C3
R1  0.229397 -0.184639 -0.231665
R2  0.399234  0.383276 -0.136577
R3  0.666110  0.526955 -0.315348
R4 -0.539079 -0.928147  0.080353

# Row selection in padas with slice operator in [ ] after or before coulmn selection

In [245]:
myDataFrame

          C1        C2        C3
R1  0.229397 -0.184639 -0.231665
R2  0.399234  0.383276 -0.136577
R3  0.666110  0.526955 -0.315348
R4 -0.539079 -0.928147  0.080353

In [246]:
myDataFrame[:1]

          C1        C2        C3
R1  0.229397 -0.184639 -0.231665

In [247]:
myDataFrame['C1']

R1    0.229397
R2    0.399234
R3    0.666110
R4   -0.539079
Name: C1, dtype: float64

In [248]:
myDataFrame[::3][['C1','C3']]

          C1        C3
R1  0.229397 -0.231665
R4 -0.539079  0.080353

In [249]:
myDataFrame[:2][['C2','C3']]

          C2        C3
R1 -0.184639 -0.231665
R2  0.383276 -0.136577

In [250]:
myDataFrame

          C1        C2        C3
R1  0.229397 -0.184639 -0.231665
R2  0.399234  0.383276 -0.136577
R3  0.666110  0.526955 -0.315348
R4 -0.539079 -0.928147  0.080353

In [251]:
myDataFrame.drop(['C1'], axis=1)

          C2        C3
R1 -0.184639 -0.231665
R2  0.383276 -0.136577
R3  0.526955 -0.315348
R4 -0.928147  0.080353

In [252]:
myDataFrame.drop(['R1'])

          C1        C2        C3
R2  0.399234  0.383276 -0.136577
R3  0.666110  0.526955 -0.315348
R4 -0.539079 -0.928147  0.080353

In [253]:
myDataFrame

          C1        C2        C3
R1  0.229397 -0.184639 -0.231665
R2  0.399234  0.383276 -0.136577
R3  0.666110  0.526955 -0.315348
R4 -0.539079 -0.928147  0.080353

# for permanent deletion we use inplace parameter in drop method

In [254]:
myDataFrame.drop(['R1'], inplace=True)
myDataFrame.drop(['C1'],axis=1, inplace=True)

# Now Permanently drop a requests

In [255]:
myDataFrame

          C2        C3
R2  0.383276 -0.136577
R3  0.526955 -0.315348
R4 -0.928147  0.080353

# How to add new Column

In [256]:
myDataFrame['C1'] = myDataFrame['C3']  * 2

In [257]:
myDataFrame

          C2        C3        C1
R2  0.383276 -0.136577 -0.273154
R3  0.526955 -0.315348 -0.630696
R4 -0.928147  0.080353  0.160707

In [258]:
myDataFrame.insert(0,'c0',(myDataFrame['C2']/3) )

In [259]:
myDataFrame

          c0        C2        C3        C1
R2  0.127759  0.383276 -0.136577 -0.273154
R3  0.175652  0.526955 -0.315348 -0.630696
R4 -0.309382 -0.928147  0.080353  0.160707

In [260]:
addFrame = pd.DataFrame(np.random.rand(1,3), ['R'], ['C2', 'C', 'C1'])

In [261]:
myDataFrame.append(addFrame)

          c0        C2        C3        C1        C
R2  0.127759  0.383276 -0.136577 -0.273154      NaN
R3  0.175652  0.526955 -0.315348 -0.630696      NaN
R4 -0.309382 -0.928147  0.080353  0.160707      NaN
R        NaN  0.153010       NaN  0.618162  0.14163

In [262]:
myDataFrame

          c0        C2        C3        C1
R2  0.127759  0.383276 -0.136577 -0.273154
R3  0.175652  0.526955 -0.315348 -0.630696
R4 -0.309382 -0.928147  0.080353  0.160707

In [263]:
myData_1 = {'i':[1, 2, 3, 4, 5],
            'c':['a', 'b', 'c', 'd', 'e']}

In [264]:
myData_1

{'i': [1, 2, 3, 4, 5], 'c': ['a', 'b', 'c', 'd', 'e']}

In [265]:
myDataFrame_1 = pd.DataFrame(myData_1, ['one','two','three', 'four', 'five'], ['i','c'])

In [266]:
myDataFrame_1

       i  c
one    1  a
two    2  b
three  3  c
four   4  d
five   5  e

# Why colums holds series and not rows

# ' . ' one colums can hold one type of values and hence one key  in dictionary can store list one type of data only

# Video 3

In [267]:
myDataFrame

          c0        C2        C3        C1
R2  0.127759  0.383276 -0.136577 -0.273154
R3  0.175652  0.526955 -0.315348 -0.630696
R4 -0.309382 -0.928147  0.080353  0.160707

In [268]:
myDataFrame[:1]

          c0        C2        C3        C1
R2  0.127759  0.383276 -0.136577 -0.273154

In [269]:
myDataFrame['C1']

R2   -0.273154
R3   -0.630696
R4    0.160707
Name: C1, dtype: float64

In [270]:
myDataFrame.loc['R2']

c0    0.127759
C2    0.383276
C3   -0.136577
C1   -0.273154
Name: R2, dtype: float64

In [271]:
myDataFrame.loc['R2','C3']

-0.13657712463440427

In [272]:
myDataFrame.loc[['R3','R2'],['C1']]

          C1
R3 -0.630696
R2 -0.273154

In [273]:
myDataFrame

          c0        C2        C3        C1
R2  0.127759  0.383276 -0.136577 -0.273154
R3  0.175652  0.526955 -0.315348 -0.630696
R4 -0.309382 -0.928147  0.080353  0.160707

In [274]:
myDataFrame.iloc[0]

c0    0.127759
C2    0.383276
C3   -0.136577
C1   -0.273154
Name: R2, dtype: float64

In [275]:
myDataFrame.iloc[0, 1]

0.38327646873966587

In [276]:
myDataFrame.iloc[[0, 1],[0, 2]]

          c0        C3
R2  0.127759 -0.136577
R3  0.175652 -0.315348

In [277]:
myDataFrame

          c0        C2        C3        C1
R2  0.127759  0.383276 -0.136577 -0.273154
R3  0.175652  0.526955 -0.315348 -0.630696
R4 -0.309382 -0.928147  0.080353  0.160707

In [278]:
myDataFrame > 1

       c0     C2     C3     C1
R2  False  False  False  False
R3  False  False  False  False
R4  False  False  False  False

In [279]:
myDataFrame[myDataFrame > 1]

    c0  C2  C3  C1
R2 NaN NaN NaN NaN
R3 NaN NaN NaN NaN
R4 NaN NaN NaN NaN

In [280]:
myDataFrame[myDataFrame['C1'] > 1]

Empty DataFrame
Columns: [c0, C2, C3, C1]
Index: []

In [281]:
myDataFrame

          c0        C2        C3        C1
R2  0.127759  0.383276 -0.136577 -0.273154
R3  0.175652  0.526955 -0.315348 -0.630696
R4 -0.309382 -0.928147  0.080353  0.160707

In [282]:
NewIndex = ['a', 'b', 'c']

In [283]:
myDataFrame['NewIndex'] = NewIndex

In [284]:
myDataFrame

          c0        C2        C3        C1 NewIndex
R2  0.127759  0.383276 -0.136577 -0.273154        a
R3  0.175652  0.526955 -0.315348 -0.630696        b
R4 -0.309382 -0.928147  0.080353  0.160707        c

In [285]:
myDataFrame.set_index('NewIndex')

                c0        C2        C3        C1
NewIndex
a         0.127759  0.383276 -0.136577 -0.273154
b         0.175652  0.526955 -0.315348 -0.630696
c        -0.309382 -0.928147  0.080353  0.160707

In [286]:
myDataFrame

          c0        C2        C3        C1 NewIndex
R2  0.127759  0.383276 -0.136577 -0.273154        a
R3  0.175652  0.526955 -0.315348 -0.630696        b
R4 -0.309382 -0.928147  0.080353  0.160707        c

In [287]:
myDataFrame.set_index('NewIndex', drop=False)

                c0        C2        C3        C1 NewIndex
NewIndex
a         0.127759  0.383276 -0.136577 -0.273154        a
b         0.175652  0.526955 -0.315348 -0.630696        b
c        -0.309382 -0.928147  0.080353  0.160707        c

In [288]:
myDataFrame.set_index('NewIndex', append=True)

                   c0        C2        C3        C1
   NewIndex
R2 a         0.127759  0.383276 -0.136577 -0.273154
R3 b         0.175652  0.526955 -0.315348 -0.630696
R4 c        -0.309382 -0.928147  0.080353  0.160707

# method 2 to set rows indexes to new names

In [289]:
myDataFrame.columns = ['a', 'b', 'c', 'd', 'e', 'f']

ValueError: Length mismatch: Expected axis has 5 elements, new values have 6 elements

In [ ]:
myDataFrame

In [ ]:
myDataFrame.index = np.arange(3, 0, -1)

In [ ]:
myDataFrame

In [ ]:
np.arange(3, 0, -1)

# rename method to change colunms and rows(index) indexing

In [ ]:
myDataFrame

In [ ]:
myDataFrame.rename(index={3:'a'}, inplace='True')

In [ ]:
myDataFrame.index

In [ ]:
myDataFrame.rename(index={'a':'a', 2:'b', 1:'c'}, inplace='True')

In [ ]:
myDataFrame

In [ ]:
myDataFrame.rename(index={'a':'a', 2:'b', 1:'c',4:'g'}, inplace='True', errors='ignore')

In [ ]:
myDataFrame.rename(index={'a':'a', 2:'b', 1:'c',4:'g'}, inplace='True', errors='raise')

In [ ]:
myDataFrame

In [297]:
myDataFrame.rename({'a':'~', 'b':'%', 'c':'&'}, inplace='True', errors='ignore')

In [296]:
myDataFrame

          c0        C2        C3        C1 NewIndex
R2  0.127759  0.383276 -0.136577 -0.273154        a
R3  0.175652  0.526955 -0.315348 -0.630696        b
R4 -0.309382 -0.928147  0.080353  0.160707        c

In [293]:
myDataFrame.rename({'a':'~', 'b':'%', 'c':'&', 'd':'!', 'e':'~', 'f':'~'},axis=1, inplace='True', errors='raise')

KeyError: "['a', 'b', 'c', 'd', 'e', 'f'] not found in axis"

In [292]:
myDataFrame

          c0        C2        C3        C1 NewIndex
R2  0.127759  0.383276 -0.136577 -0.273154        a
R3  0.175652  0.526955 -0.315348 -0.630696        b
R4 -0.309382 -0.928147  0.080353  0.160707        c

In [291]:
myDataFrame.rename({'~':'1', '%':'2','&':'3'})

          c0        C2        C3        C1 NewIndex
R2  0.127759  0.383276 -0.136577 -0.273154        a
R3  0.175652  0.526955 -0.315348 -0.630696        b
R4 -0.309382 -0.928147  0.080353  0.160707        c

In [290]:
myDataFrame

          c0        C2        C3        C1 NewIndex
R2  0.127759  0.383276 -0.136577 -0.273154        a
R3  0.175652  0.526955 -0.315348 -0.630696        b
R4 -0.309382 -0.928147  0.080353  0.160707        c

In [391]:
myShares = { 'sushant':[np.NaN, 340, np.NaN, 100], 'sujay':[np.NaN, 200, 350, 100], 'suvesh':[np.NaN, 450, 300, 100]}

In [392]:
myShares

{'sushant': [nan, 340, nan, 100],
 'sujay': [nan, 200, 350, 100],
 'suvesh': [nan, 450, 300, 100]}

In [393]:
mySharesFrame = pd.DataFrame(myShares)

In [394]:
mySharesFrame

   sushant  sujay  suvesh
0      NaN    NaN     NaN
1    340.0  200.0   450.0
2      NaN  350.0   300.0
3    100.0  100.0   100.0

In [318]:
mySharesFrame.dropna()

   sushant  sujay  suvesh
1    340.0  200.0   450.0
3    100.0  100.0   100.0

In [320]:
mySharesFrame.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [326]:
mySharesFrame.dropna(how='all')

   sushant  sujay  suvesh
1    340.0  200.0   450.0
2      NaN  350.0   300.0
3    100.0  100.0   100.0

In [346]:
mySharesFrame.insert(3,'NULL',[np.NaN, np.NaN, np.NaN,np.NaN])

In [347]:
mySharesFrame

   sushant  sujay  suvesh  NULL
0      NaN    NaN     NaN   NaN
1    340.0  200.0   450.0   NaN
2      NaN  350.0   300.0   NaN
3    100.0  100.0   100.0   NaN

In [368]:
mySharesFrame.dropna(thresh=3)

   sushant  sujay  suvesh  NULL
1    340.0  200.0   450.0   NaN
3    100.0  100.0   100.0   NaN

In [344]:
mySharesFrame.drop(['NULL'], axis=1, inplace=True)

In [348]:
mySharesFrame

   sushant  sujay  suvesh  NULL
0      NaN    NaN     NaN   NaN
1    340.0  200.0   450.0   NaN
2      NaN  350.0   300.0   NaN
3    100.0  100.0   100.0   NaN

In [375]:
mySharesFrame.dropna(subset=['sushant'])

   sushant  sujay  suvesh  NULL
1    340.0  200.0   450.0   NaN
3    100.0  100.0   100.0   NaN

In [376]:
mySharesFrame

   sushant  sujay  suvesh  NULL
0      NaN    NaN     NaN   NaN
1    340.0  200.0   450.0   NaN
2      NaN  350.0   300.0   NaN
3    100.0  100.0   100.0   NaN

In [382]:
mySharesFrame.dropna(thresh=3)

   sushant  sujay  suvesh  NULL
1    340.0  200.0   450.0   NaN
3    100.0  100.0   100.0   NaN

In [384]:
mySharesFrame.drop(['NULL'], axis=1, inplace=True)

In [385]:
mySharesFrame

   sushant  sujay  suvesh
0      NaN    NaN     NaN
1    340.0  200.0   450.0
2      NaN  350.0   300.0
3    100.0  100.0   100.0

In [386]:
mySharesFrame['sushant'].fillna(value=mySharesFrame['sushant'].mean(), inplace=True)

In [387]:
mySharesFrame

   sushant  sujay  suvesh
0    220.0    NaN     NaN
1    340.0  200.0   450.0
2    220.0  350.0   300.0
3    100.0  100.0   100.0

In [388]:
mySharesFrame['sujay'].fillna(value=mySharesFrame['sujay'].mean(), inplace=True)

In [389]:
mySharesFrame['suvesh'].fillna(value=mySharesFrame['suvesh'].mean(), inplace=True)

In [390]:
mySharesFrame

   sushant       sujay      suvesh
0    220.0  216.666667  283.333333
1    340.0  200.000000  450.000000
2    220.0  350.000000  300.000000
3    100.0  100.000000  100.000000

In [395]:
mySharesFrame

   sushant  sujay  suvesh
0      NaN    NaN     NaN
1    340.0  200.0   450.0
2      NaN  350.0   300.0
3    100.0  100.0   100.0

In [408]:
mySharesFrame.fillna(1, limit=1)

   sushant  sujay  suvesh
0      1.0    1.0     1.0
1    340.0  200.0   450.0
2      NaN  350.0   300.0
3    100.0  100.0   100.0

In [1]:
newData = {
    'Movies': [ 'Star-Wars', 'Star-Wars', 'Batman', 'Batman', 'Deadpool', 'Deadpool'],
    'Viewers': [ 'sushant', 'shreyas', 'tejas', 'tushar', 'deepak', 'sangram'],
    'Ratings': [10, 7, 6, 9, 8, 5]
}

In [2]:
newData

{'Movies': ['Star-Wars',
  'Star-Wars',
  'Batman',
  'Batman',
  'Deadpool',
  'Deadpool'],
 'Viewers': ['sushant', 'shreyas', 'tejas', 'tushar', 'deepak', 'sangram'],
 'Ratings': [10, 7, 6, 9, 8, 5]}

In [4]:
myMovieFrame = pd.DataFrame(newData)

In [5]:
myMovieFrame

      Movies  Viewers  Ratings
0  Star-Wars  sushant       10
1  Star-Wars  shreyas        7
2     Batman    tejas        6
3     Batman   tushar        9
4   Deadpool   deepak        8
5   Deadpool  sangram        5

In [44]:
myMovieFrame.groupby('Movies').sum()

           Ratings
Movies
Batman          15
Deadpool        13
Star-Wars       17

In [42]:
myMovieFrame.groupby('Movies').sum().loc['Batman']

Ratings    15
Name: Batman, dtype: int64

In [43]:
myMovieFrame.groupby('Movies').mean().iloc[2]

Ratings    8.5
Name: Star-Wars, dtype: float64

In [45]:
myMovieFrame.groupby('Movies').describe()

          Ratings
            count mean      std  min   25%  50%   75%   max
Movies
Batman        2.0  7.5  2.12132  6.0  6.75  7.5  8.25   9.0
Deadpool      2.0  6.5  2.12132  5.0  5.75  6.5  7.25   8.0
Star-Wars     2.0  8.5  2.12132  7.0  7.75  8.5  9.25  10.0

In [1]:
pwd

'C:\\Users\\sushant\\Desktop\\ML\\2_Pandas'

In [5]:
dataFrame = pd.read_csv('example-csv.csv')

In [6]:
dataFrame

      1     2     3
0    11    22    33
1   111   222   333
2  1111  2222  3333

In [8]:
dataFrame.to_csv('squad.csv', index=False)

In [11]:
pd.read_csv('squad.csv')

      1     2     3
0    11    22    33
1   111   222   333
2  1111  2222  3333

In [12]:
excelFrame = pd.read_excel('example-excel-output.xlsx')

In [18]:
excelFrame

   0  1
0  1  2
1  3  4

In [25]:
excelFrame.to_excel('f.xlsx')

In [26]:
excelFrame

   0  1
0  1  2
1  3  4